In [537]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder
from sklearn import tree
from sklearn.model_selection import train_test_split
import warnings
warnings.filterwarnings('ignore')

In [538]:
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [539]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

# Dependent and Independent Variable

In [540]:
# using Pclass, Sex, Age and Fare columns as independent variables
X = df[['Pclass', 'Sex', 'Age', 'Fare']] 
X.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [541]:
# target variable
y = df['Survived']
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [542]:
# out of the 4 columns,Age only contains null values
# using the interpolate method on the Age column
X['age'] = X['Age'].fillna(X['Age'].median()) # using X because, we z nor dealing with the whole dataframe
X['age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    28.0
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [543]:
# Data entries in Sex column are strings...
# Using LabelEncoder..,
le = LabelEncoder()
X['Sex_new'] = le.fit_transform(X['Sex'])
X['Sex_new'] #ðŸ¥³ðŸ¥³

0      1
1      0
2      0
3      0
4      1
      ..
886    1
887    0
888    0
889    1
890    1
Name: Sex_new, Length: 891, dtype: int32

In [544]:
X

     Pclass     Sex   Age     Fare   age  Sex_new
0         3    male  22.0   7.2500  22.0        1
1         1  female  38.0  71.2833  38.0        0
2         3  female  26.0   7.9250  26.0        0
3         1  female  35.0  53.1000  35.0        0
4         3    male  35.0   8.0500  35.0        1
..      ...     ...   ...      ...   ...      ...
886       2    male  27.0  13.0000  27.0        1
887       1  female  19.0  30.0000  19.0        0
888       3  female   NaN  23.4500  28.0        0
889       1    male  26.0  30.0000  26.0        1
890       3    male  32.0   7.7500  32.0        1

[891 rows x 6 columns]

In [545]:
# dropping initial Age and Sex column
X.drop(['Age', 'Sex'], axis = 1, inplace = True)

In [579]:
# splittting into train and test sets
X_train, X_test, y_train, y_test = train_test_split(X,y, test_size = 0.30, random_state = 10)

Building a Decision Tree Model

In [580]:
model = tree.DecisionTreeClassifier(criterion = 'entropy')
model

DecisionTreeClassifier(criterion='entropy')

In [581]:
model.fit(X_train, y_train)

DecisionTreeClassifier(criterion='entropy')

In [582]:
model.score(X_test, y_test)

0.8246268656716418

In [574]:
model.predict(X_test)

array([0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       1, 1, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1,
       1, 1, 1, 0, 1, 0, 0, 0, 0, 1, 1, 1, 0, 1, 1, 0, 0, 1, 1, 1, 0, 0,
       0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1,
       0, 1, 0, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 1, 1, 0,
       1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 1, 1, 0, 0, 1, 1, 0,
       0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0,
       0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0,
       0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0,
       1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0,
       1, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 1,
       0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 1, 1,
       0, 0, 0, 1], dtype=int64)